Autodesk.Revit.DB.FormattedTextRun.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FormattedTextRun.BaselineStyle
Specifies the style of the text as related to the baseline position.
Since:
2016

Autodesk.Revit.DB.FormattedTextRun.ListStyle
Specifies the style of a paragraph if the paragraph is a list.
Since:
2016

Autodesk.Revit.DB.FormattedTextRun.TabNumber
For a text run that starts at a tab stop, this value indicates the number of the tab stop.
Since:
2016

Autodesk.Revit.DB.FormattedTextRun.NewParagraph
Indicates whether this text run starts a new paragraph.
Since:
2016

Autodesk.Revit.DB.FormattedTextRun.NewLine
Indicates whether this text run starts on a new line.
Since:
2016

Autodesk.Revit.DB.FormattedTextRun.Underlined
Indicates whether this text run uses Underlined text.
Since:
2016

Autodesk.Revit.DB.FormattedTextRun.Italic
Indicates whether this text run uses Italic text.
Since:
2016

Autodesk.Revit.DB.FormattedTextRun.Bold
Indicates whether this text run uses Bold text.
Since:
2016

Autodesk.Revit.DB.FormattedTextRun.Text
The text segment in this text run.
Since:
2016

Autodesk.Revit.DB.FormattedTextRun
A structure that defines a single run of a formatted text.
Remarks:
A text run identifies a segment of text content with formatting style that
does not change for the entire run. In other words, text runs are separated by
differences in formatting. However, runs are also separated by tabulators and
line-ends, which means that any multi-line text will have number of runs equal
or higher than the number of lines even if the text itself has uniform formatting throughout.
A collection of text runs can be obtained from a Autodesk.Revit.DB.TextNode
by calling Autodesk.Revit.DB.TextNode.GetFormattedTextRuns.
See also: Autodesk.Revit.DB.IModelExportContext.OnText(Autodesk.Revit.DB.TextNode)
for more details about text output during custom exports.
Since:
2016